bow_dict = {"academic":{"words":['ตารางเรียน',"ตาราง",'เรียน','ตารางสอบ',"ตาราง",'สอบ','หลักสูตร','ปพ.7','ปพ.1','Transcript','EP','English Program'],"sectors":["ฝ่ายวิชาการ"]},
                    "food":{"words":['อาหาร', 'อิสลาม', 'เมนู','สหกรณ์','ขาย', 'เสื้อ', 'พละ', 'กางเกง','รองเท้า', 'ชุด', 'จำหน่าย','ปักเสื้อ',"ปัก",'เสื้อ','ซื้อหนังสือ',"ซื้อ",'หนังสือ','กระเป๋าล้อลาก',"กระเป๋า",'ล้อลาก'],"sectors":["ฝ่ายโภชนาการ"]},
                    "activity":{"words":['ระเบียบ','ทรงผม',"ทรง",'ผม','รด','กิจกรรม', 'ดนตรี'],"sectors":["ฝ่ายปกครอง"]},
                    "administration":{"words":['สมัครบุคลากร',"สมัคร",'บุคลากร','ค่าธรรมเนียมการศึกษา',"ค่า", 'ธรรมเนียม', 'การ', 'ศึกษา','ค่าเทอม',"ค่า",'เทอม','ผ่อนค่าเทอม'"ผ่อน",'ค่าเทอม' ],"sectors":["ฝ่ายธุรการ"]},
                    "it":{"words":['จ่ายค่าเทอม',"จ่าย",'ค่าเทอม','ค้างชำระ',"ค้าง",'ชำระ','รถตู้',"รถ",'ตู้','ว่ายน้ำ','รถรับส่ง',"รถ",'รับ','ส่ง','ผลการเรียน',"ผล",'การ','เรียน','คูปอง','เติมเงิน',"เติม",'เงิน','ดู', 'เกรด', 'เฉลี่ย','ประกาศ','คะแนน'],"sectors":["ศูนย์พัฒนาโรงเรียนดิจิทัล"]}
            }

def categorize_text(text, bow_dict):
    scores = {"academic": 0, "food": 0, "activity": 0, "administration": 0, "it": 0}
    for category, category_data in bow_dict.items():
        words = category_data["words"]
        for word in words:
            if word in text:
                scores[category] += 1
    return scores
