#type 1 == ฝ่ายวิชาการ / โครงการพิเศษ / EP 
academic = ['ตารางเรียน',"ตาราง",'เรียน','ตารางสอบ',"ตาราง",'สอบ','หลักสูตร','ปพ.7','ปพ.1','Transcript','EP','English Program']

#type 2 == ฝ่ายโภชนาการ / พัสดุ / สหกรณ์
food = ['อาหาร', 'อิสลาม', 'เมนู','สหกรณ์','ขาย', 'เสื้อ', 'พละ', 'กางเกง','รองเท้า', 'ชุด', 'จำหน่าย','ปักเสื้อ',"ปัก",'เสื้อ','ซื้อหนังสือ',"ซื้อ",'หนังสือ','กระเป๋าล้อลาก',"กระเป๋า",'ล้อลาก']

#type 3 == ฝ่ายปกครอง / กิจการนักเรียน / กิจกรรมต่างๆ โครงการภายใน-นอก
activity = ['ระเบียบ','ทรงผม',"ทรง",'ผม','รด','กิจกรรม', 'ดนตรี']

#type 4 == ฝ่ายธุรการ / ฝ่ายบัญชี / บริหาร
administration = ['สมัครบุคลากร',"สมัคร",'บุคลากร','ค่าธรรมเนียมการศึกษา',"ค่า", 'ธรรมเนียม', 'การ', 'ศึกษา','ค่าเทอม',"ค่า",'เทอม','ผ่อนค่าเทอม'"ผ่อน",'ค่าเทอม']

# type 5 == ศูนย์พัฒนาโรงเรียนดิจิทัล 
it = ['จ่ายค่าเทอม',"จ่าย",'ค่าเทอม','ค้างชำระ',"ค้าง",'ชำระ','รถตู้',"รถ",'ตู้','ว่ายน้ำ','รถรับส่ง',"รถ",'รับ','ส่ง','ผลการเรียน',"ผล",'การ','เรียน','คูปอง','เติมเงิน',"เติม",'เงิน','ดู', 'เกรด', 'เฉลี่ย','ประกาศ','คะแนน']


data_dict = {"academic":{"words":['ตารางเรียน',"ตาราง",'เรียน','ตารางสอบ',"ตาราง",'สอบ','หลักสูตร','ปพ.7','ปพ.1','Transcript','EP','English Program'],"description":["ฝ่ายวิชาการ"]},
    "food":{"words":['อาหาร', 'อิสลาม', 'เมนู','สหกรณ์','ขาย', 'เสื้อ', 'พละ', 'กางเกง','รองเท้า', 'ชุด', 'จำหน่าย','ปักเสื้อ',"ปัก",'เสื้อ','ซื้อหนังสือ',"ซื้อ",'หนังสือ','กระเป๋าล้อลาก',"กระเป๋า",'ล้อลาก'],"description":["ฝ่ายโภชนาการ"]},
                "activity":{"words":['ระเบียบ','ทรงผม',"ทรง",'ผม','รด','กิจกรรม', 'ดนตรี'],"description":["ฝ่ายปกครอง"]},
                "administration":{"words":['สมัครบุคลากร',"สมัคร",'บุคลากร','ค่าธรรมเนียมการศึกษา',"ค่า", 'ธรรมเนียม', 'การ', 'ศึกษา','ค่าเทอม',"ค่า",'เทอม','ผ่อนค่าเทอม'"ผ่อน",'ค่าเทอม' ],"description":["ฝ่ายธุรการ"]},
                "it":{"words":['จ่ายค่าเทอม',"จ่าย",'ค่าเทอม','ค้างชำระ',"ค้าง",'ชำระ','รถตู้',"รถ",'ตู้','ว่ายน้ำ','รถรับส่ง',"รถ",'รับ','ส่ง','ผลการเรียน',"ผล",'การ','เรียน','คูปอง','เติมเงิน',"เติม",'เงิน','ดู', 'เกรด', 'เฉลี่ย','ประกาศ','คะแนน'],"description":["ศูนย์พัฒนาโรงเรียนดิจิทัล"]}
}


